---
type: StructuralElementDefinitionData
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 14
tags: [revit-api, class]
---

# StructuralElementDefinitionData

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData` · Revit 2024 · 14 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralElementDefinitionData | 2018 | `public StructuralElementDefinitionData ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | CenterCurve | 2018 | `public Curve CenterCurve { get ; }` |
| Property | Curve | 2018 | `public Curve Curve { get ; }` |
| Property | EndShortening | 2018 | `public double EndShortening { get ; }` |
| Property | IsMirrored | 2018 | `public bool IsMirrored { get ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Normal | 2018 | `public XYZ Normal { get ; }` |
| Property | Section | 2018 | `public StructuralSection Section { get ; }` |
| Property | StartShortening | 2018 | `public double StartShortening { get ; }` |
| Property | YJust | 2018 | `public YJustification YJust { get ; }` |
| Property | YOffset | 2018 | `public double YOffset { get ; }` |
| Property | ZJust | 2018 | `public ZJustification ZJust { get ; }` |
| Property | ZOffset | 2018 | `public double ZOffset { get ; }` |